2017-11-17-Smartparens-is-5-years-old-today.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-17 Fri 18:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Smartparens is 5 years old today</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matúš Goljer" />
<link rel="stylesheet" href="css/blog.css" />
</head>
<body>
<div id="preamble" class="status">

<div style="text-align: left; float: left;">
  <a href="./sitemap.html">Home</a>
  <a href="https://github.com/Fuco1/">GitHub</a>
  <a href="https://www.patreon.com/user?u=3282358">Patreon</a>
</div>
<div style="text-align: right;">
  <a href="https://fuco1.github.io/rss.xml">RSS</a>
  <a href="https://twitter.com/Fuco1337">Twitter</a>
</div>
<hr />
</div>
<div id="content">
<h1 class="title">Smartparens is 5 years old today</h1>

<p>
Five years ago I've published the <a href="https://github.com/Fuco1/smartparens/commit/cf39349e1966d20ce0c9f370d7310500d5da1637">first version</a> of Smartparens on
Github.  To celebrate the occasion I've just released Smartparens
version <a href="https://github.com/Fuco1/smartparens/releases/tag/1.11.0">1.11.0</a> packed with new features, bug fixes and some
performance optimizations.
</p>

<p>
This project has become a huge part of my life and evolved along with
me over the years.  I have started working on it pretty much on the
day when I first started using Emacs.  One can almost say that the
project was only born thanks to my ignorance of Emacs landscape&#x2014;had
I known of paredit I would have probably never started, or maybe start
but a lot later and with different setup in mind.
</p>

<p>
Today with over 350.000 downloads on MELPA it is one of the biggest
projects in Emacs land; and I'm aiming for the top!  The ubiquity of
it still shocks me and every time I randomly read a blog post or an
article where someone mentions Smartparens it feels just like years
ago&#x2014;a sense of deep appreciation and gratefulness, not only for the
kind words but also simply for the fact that I am able to do something
like this and can rightly call myself amazingly fortunate.
</p>

<p>
I had no idea what I was doing but the response from the community was
amazing and very encouraging.  One special shout out has to go to the
amazing <a href="http://batsov.com/">Bozhidar Batsov</a> who <a href="https://twitter.com/bbatsov/status/350889256048279553?lang=en">switched Prelude</a> to use Smartparens not
even half a year after I started the project.  This was a huge deal
for the growth of the project with thousands of new users coming in
pretty much over night.
</p>

<p>
This early success encouraged me to start other (Emacs) projects of
which I now have well over 50 and I have contributed to countless
others.
</p>

<p>
Thanks also go to all the <a href="https://github.com/Fuco1/smartparens/graphs/contributors">contributors</a> who helped to move Smartparens
to where it is now; and also many others who reported issues and
provided suggestions for improvements.  I can't name you all but your
efforts are much appreciated!
</p>

<p>
I had pretty rough and packed year but I hope to get back on track
with the release schedule and start a more rapid release cycle.
Expect more goodies to come soon :)
</p>

<p>
Thanks again and enjoy the new release everyone!
</p>

<p>
-&#x2014;
</p>

<p>
PS: You can send some love through <a href="https://www.patreon.com/user?u=3282358&amp;ty=h">Patreon</a> or <a href="https://www.paypal.me/MatusGoljer">PayPal</a>.
</p>
</div>
<div id="postamble" class="status">
<hr />
<div style="text-align: left; float: left;">Last updated at: 2017-11-17 18:41</div>
<div style="text-align: right;">Found a typo? <a href="https://github.com/Fuco1/fuco1.github.io/blob/master/posts/2017-11-17-Smartparens-is-5-years-old-today.org">Edit on GitHub!</a></div>
</div>
</body>
</html>
